Revit 2026 API

# TransformInverse Property

---

The inverse transformation of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform Inverse { get; }
```
```vb
Public ReadOnly Property Inverse As Transform
	Get
```
```cpp
public:
property Transform^ Inverse {
	Transform^ get ();
}
```
```fsharp
member Inverse : Transform with get
```

#### Property Value

Transform

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this transformation is not conformal or invertible. |

The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).

#### Reference

Transform Class

Autodesk.Revit.DB Namespace